In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([10, 20, 30, 40], columns = ['numbers'], index = ['a', 'b', 'c', 'd'])
df

   numbers
a       10
b       20
c       30
d       40

In [3]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [4]:
df.columns

Index(['numbers'], dtype='object')

In [5]:
df.loc['c']

numbers    30
Name: c, dtype: int64

In [6]:
df.loc[['a', 'd']]

   numbers
a       10
d       40

In [7]:
df.loc[df.index[1:3]]

   numbers
b       20
c       30

In [8]:
df.sum()

numbers    100
dtype: int64

In [9]:
df.apply(lambda x: x**2)

   numbers
a      100
b      400
c      900
d     1600

In [10]:
df ** 2

   numbers
a      100
b      400
c      900
d     1600

In [11]:
df['floats'] = (1.5, 2.5, 3.5, 4.5)
df

   numbers  floats
a       10     1.5
b       20     2.5
c       30     3.5
d       40     4.5

In [12]:
df['floats']

a    1.5
b    2.5
c    3.5
d    4.5
Name: floats, dtype: float64

In [13]:
df['names'] = pd.DataFrame(['Yves', 'Guido', 'Felix', 'Francesc'],
index=['d', 'a', 'b', 'c'])
df

   numbers  floats     names
a       10     1.5     Guido
b       20     2.5     Felix
c       30     3.5  Francesc
d       40     4.5      Yves

In [14]:
df.append({'numbers': 100, 'floats': 5.75, 'names': 'Henry'}, ignore_index=True)

   numbers  floats     names
0       10    1.50     Guido
1       20    2.50     Felix
2       30    3.50  Francesc
3       40    4.50      Yves
4      100    5.75     Henry

In [15]:
df = df.append(pd.DataFrame({'numbers': 100, 'floats': 5.75,
'names': 'Henry'}, index=['z',]))
df

   floats     names  numbers
a    1.50     Guido       10
b    2.50     Felix       20
c    3.50  Francesc       30
d    4.50      Yves       40
z    5.75     Henry      100

In [16]:
df.join(pd.DataFrame([1, 4, 9, 16, 25],
index=['a', 'b', 'c', 'd', 'y'],
columns=['squares',]))

   floats     names  numbers  squares
a    1.50     Guido       10      1.0
b    2.50     Felix       20      4.0
c    3.50  Francesc       30      9.0
d    4.50      Yves       40     16.0
z    5.75     Henry      100      NaN

In [19]:
df = df.join(pd.DataFrame([1, 4, 9, 16, 25],
index=['a', 'b', 'c', 'd', 'y'],
columns=['squares',]),
how='outer')
df

   floats     names  numbers  squares
a    1.50     Guido     10.0      1.0
b    2.50     Felix     20.0      4.0
c    3.50  Francesc     30.0      9.0
d    4.50      Yves     40.0     16.0
y     NaN       NaN      NaN     25.0
z    5.75     Henry    100.0      NaN

In [20]:
df[['numbers', 'squares']].mean()

numbers    40.0
squares    11.0
dtype: float64

In [21]:
df[['numbers', 'squares']].std()

numbers    35.355339
squares     9.669540
dtype: float64

In [23]:
a = np.random.standard_normal((9, 4))
a.round(6)

array([[-0.169866,  0.575429, -1.960291,  1.700077],
       [-0.378749,  0.541274, -0.243142,  0.876425],
       [-0.319854, -0.08066 ,  0.173262, -0.006522],
       [-0.959445,  1.155096,  0.643241, -1.200404],
       [ 0.795097, -0.272406,  0.239964,  0.212829],
       [-0.278001,  1.223663,  1.244373, -1.58742 ],
       [ 0.591398,  0.019109, -0.726688, -1.086027],
       [-1.639197,  0.964592,  0.1744  ,  1.181461],
       [ 0.087791, -0.369904, -0.526634,  0.991087]])

In [24]:
df = pd.DataFrame(a)
df

          0         1         2         3
0 -0.169866  0.575429 -1.960291  1.700077
1 -0.378749  0.541274 -0.243142  0.876425
2 -0.319854 -0.080660  0.173262 -0.006522
3 -0.959445  1.155096  0.643241 -1.200404
4  0.795097 -0.272406  0.239964  0.212829
5 -0.278001  1.223663  1.244373 -1.587420
6  0.591398  0.019109 -0.726688 -1.086027
7 -1.639197  0.964592  0.174400  1.181461
8  0.087791 -0.369904 -0.526634  0.991087

In [28]:
df.columns = [['No1', 'No2', 'No3', 'No4']]
df

        No1       No2       No3       No4
0 -0.169866  0.575429 -1.960291  1.700077
1 -0.378749  0.541274 -0.243142  0.876425
2 -0.319854 -0.080660  0.173262 -0.006522
3 -0.959445  1.155096  0.643241 -1.200404
4  0.795097 -0.272406  0.239964  0.212829
5 -0.278001  1.223663  1.244373 -1.587420
6  0.591398  0.019109 -0.726688 -1.086027
7 -1.639197  0.964592  0.174400  1.181461
8  0.087791 -0.369904 -0.526634  0.991087

In [61]:
df.loc[3]['No2']

No2    1.155096
Name: 3, dtype: float64

In [60]:
df.loc[3, 'No2']

No2    1.155096
Name: 3, dtype: float64

In [64]:
df.iat[3,1]

1.155095826890641

In [71]:
dates = pd.date_range('2015-1-1', periods= 9, freq="M")
dates

DatetimeIndex(['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30',
               '2015-05-31', '2015-06-30', '2015-07-31', '2015-08-31',
               '2015-09-30'],
              dtype='datetime64[ns]', freq='M')

In [72]:
df.index = dates
df

                 No1       No2       No3       No4
2015-01-31 -0.169866  0.575429 -1.960291  1.700077
2015-02-28 -0.378749  0.541274 -0.243142  0.876425
2015-03-31 -0.319854 -0.080660  0.173262 -0.006522
2015-04-30 -0.959445  1.155096  0.643241 -1.200404
2015-05-31  0.795097 -0.272406  0.239964  0.212829
2015-06-30 -0.278001  1.223663  1.244373 -1.587420
2015-07-31  0.591398  0.019109 -0.726688 -1.086027
2015-08-31 -1.639197  0.964592  0.174400  1.181461
2015-09-30  0.087791 -0.369904 -0.526634  0.991087

In [73]:
np.array(df).round(6)

array([[-0.169866,  0.575429, -1.960291,  1.700077],
       [-0.378749,  0.541274, -0.243142,  0.876425],
       [-0.319854, -0.08066 ,  0.173262, -0.006522],
       [-0.959445,  1.155096,  0.643241, -1.200404],
       [ 0.795097, -0.272406,  0.239964,  0.212829],
       [-0.278001,  1.223663,  1.244373, -1.58742 ],
       [ 0.591398,  0.019109, -0.726688, -1.086027],
       [-1.639197,  0.964592,  0.1744  ,  1.181461],
       [ 0.087791, -0.369904, -0.526634,  0.991087]])

In [74]:
df.sum()

No1   -2.270826
No2    3.756194
No3   -0.981515
No4    1.081507
dtype: float64

In [75]:
df.mean()

No1   -0.252314
No2    0.417355
No3   -0.109057
No4    0.120167
dtype: float64

In [76]:
df.cumsum()

                 No1       No2       No3       No4
2015-01-31 -0.169866  0.575429 -1.960291  1.700077
2015-02-28 -0.548615  1.116704 -2.203433  2.576503
2015-03-31 -0.868469  1.036044 -2.030171  2.569981
2015-04-30 -1.827914  2.191140 -1.386930  1.369578
2015-05-31 -1.032816  1.918734 -1.146966  1.582407
2015-06-30 -1.310817  3.142396  0.097406 -0.005013
2015-07-31 -0.719419  3.161506 -0.629282 -1.091041
2015-08-31 -2.358616  4.126098 -0.454882  0.090420
2015-09-30 -2.270826  3.756194 -0.981515  1.081507

In [77]:
df.describe()

            No1       No2       No3       No4
count  9.000000  9.000000  9.000000  9.000000
mean  -0.252314  0.417355 -0.109057  0.120167
std    0.739601  0.616073  0.913816  1.177508
min   -1.639197 -0.369904 -1.960291 -1.587420
25%   -0.378749 -0.080660 -0.526634 -1.086027
50%   -0.278001  0.541274  0.173262  0.212829
75%    0.087791  0.964592  0.239964  0.991087
max    0.795097  1.223663  1.244373  1.700077

In [78]:
np.sqrt(df)

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in sqrt
  """Entry point for launching an IPython kernel.

                 No1       No2       No3       No4
2015-01-31       NaN  0.758571       NaN  1.303870
2015-02-28       NaN  0.735713       NaN  0.936176
2015-03-31       NaN       NaN  0.416248       NaN
2015-04-30       NaN  1.074754  0.802023       NaN
2015-05-31  0.891682       NaN  0.489861  0.461334
2015-06-30       NaN  1.106193  1.115515       NaN
2015-07-31  0.769024  0.138237       NaN       NaN
2015-08-31       NaN  0.982136  0.417612  1.086950
2015-09-30  0.296295       NaN       NaN  0.995533

In [79]:
np.sqrt(df).sum()

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in sqrt
  """Entry point for launching an IPython kernel.

No1    1.957001
No2    4.795605
No3    3.241259
No4    4.783864
dtype: float64

In [81]:
%matplotlib inline

In [ ]:
df.cumsum().pl